In [1]:
## Importing required labraries - 
import pandas as pd

In [2]:
data = pd.read_csv('D:/Top Mentor/cast.csv') ## importing the required file from system 
print(data.head(2))

             title  year      name   type character     n
0   Closet Monster  2015  Buffy #1  actor   Buffy 4   NaN
1  Suuri illusioni  1985    Homo $  actor    Guests  22.0

In [3]:
df = data.copy()   ## First copy our required data 
print(df.head(2))

             title  year      name   type character     n
0   Closet Monster  2015  Buffy #1  actor   Buffy 4   NaN
1  Suuri illusioni  1985    Homo $  actor    Guests  22.0

### In Given data sheet - columns are 5 - 
# Title meand - Movie name 
# year - movie releasing year
# name  - actor name 
# type - type of actor male / female
# charecter - roll
# n - stand for rank of movie

In [4]:
## Reading the data first - 
print('Min year - ',df['year'].min())
print('Max year - ',df['year'].max())
print('Min n - ',df['n'].min())
print('Max n - ',df['n'].max())
print('No of Unique Title - ',df['title'].nunique())
print('No of Unique character - ',df['character'].nunique())
print('No of Unique name - ',df['name'].nunique())
print('No of Unique type - ',df['type'].nunique())

Min year -  1894
Max year -  2023
Min n -  1.0
Max n -  33613.0
No of Unique Title -  172293
No of Unique character -  1535710
No of Unique name -  1322023
No of Unique type -  2

In [7]:
##Checking Data Parameter :-
print('no of columns - ' , df.columns)
print('no of shapes - ' , df.shape)
print('no of lenght - ' , len(df))
print('no of datatype - \n' , df.dtypes)
print('data information - ' , df.info)

no of columns -  Index(['title', 'year', 'name', 'type', 'character', 'n'], dtype='object')
no of shapes -  (3611212, 6)
no of lenght -  3611212
no of datatype -
 title         object
year           int64
name          object
type          object
character     object
n            float64
dtype: object
data information -  <bound method DataFrame.info of                                     title  year                         name  \
0                          Closet Monster  2015                     Buffy #1
1                         Suuri illusioni  1985                       Homo $
2                     Battle of the Sexes  2017                      $hutter
3                    Secret in Their Eyes  2015                      $hutter
4                              Steve Jobs  2015                      $hutter
...                                   ...   ...                          ...
3611207                           Foxtrot  1988            Lilja ??risd?ttir
3611208  Niceland (Population. 1.000.002)  2004    Sigr??ur J?na ??risd?ttir
3611209                         Skammdegi  1985           Dalla ??r?ard?ttir
3611210                      U.S.S.S.S...  2003  Krist?n Andrea ??r?ard?ttir
3611211                 Bye Bye Blue Bird  1999                 Rosa ? R?gvu

            type                character     n
0          actor                  Buffy 4   NaN
1          actor                   Guests  22.0
2          actor          Bobby Riggs Fan  10.0
3          actor          2002 Dodger Fan   NaN
4          actor  1988 Opera House Patron   NaN
...          ...                      ...   ...
3611207  actress                     D?ra  24.0
3611208  actress             Woman in Bus  26.0
3611209  actress            Hj?krunarkona   9.0
3611210  actress   Afgr.dama ? bens?nst??  17.0
3611211  actress        Pensionatv?rtinde   NaN

[3611212 rows x 6 columns]>

In [8]:
### Count of Missing Value 
df.isnull().sum()

title              6
year               0
name               0
type               0
character         14
n            1379242
dtype: int64

In [5]:
######  Missing Value %
missing_Value = df.isnull().sum()
total_value = len(df)
print(missing_Value)
print(total_value)

title              6
year               0
name               0
type               0
character         14
n            1379242
dtype: int64
3611212

In [10]:
missing_percentage = (missing_Value / total_value)*100
print('percentage of missing value - \n',missing_percentage)

percentage of missing value -
 title         0.000166
year          0.000000
name          0.000000
type          0.000000
character     0.000388
n            38.193327
dtype: float64

## if missing value percentage is greater than 30% then we have to drop this column 
## if we want to fill this data that time we have use the fuction is fill na .

In [6]:
### Performing missing on entire dataset 
## n column & imputing the missing ranks with 0 
df['n']=df['n'].fillna(0)
df.head(3)
df[df.isnull()!=True] ## we fill all number value easily by using fill na funcation imputing the 0 .## True is use for permanment mark the rank .

,title,year,name,type,character,n
0,Closet Monster,2015,Buffy #1,actor,Buffy 4,0.0
1,Suuri illusioni,1985,Homo $,actor,Guests,22.0
2,Battle of the Sexes,2017,$hutter,actor,Bobby Riggs Fan,10.0
3,Secret in Their Eyes,2015,$hutter,actor,2002 Dodger Fan,0.0
4,Steve Jobs,2015,$hutter,actor,1988 Opera House Patron,0.0
...,...,...,...,...,...,...
3611207,Foxtrot,1988,Lilja ??risd?ttir,actress,D?ra,24.0
3611208,Niceland (Population. 1.000.002),2004,Sigr??ur J?na ??risd?ttir,actress,Woman in Bus,26.0
3611209,Skammdegi,1985,Dalla ??r?ard?ttir,actress,Hj?krunarkona,9.0
3611210,U.S.S.S.S...,2003,Krist?n Andrea ??r?ard?ttir,actress,Afgr.dama ? bens?nst??,17.0
3611211,Bye Bye Blue Bird,1999,Rosa ? R?gvu,actress,Pensionatv?rtinde,0.0

## now we are checking again the fill na value count -

In [7]:
df.isnull().sum()

title         6
year          0
name          0
type          0
character    14
n             0
dtype: int64

In [8]:
df[df.isnull()==True]

        title  year name type character   n
0         NaN   NaN  NaN  NaN       NaN NaN
1         NaN   NaN  NaN  NaN       NaN NaN
2         NaN   NaN  NaN  NaN       NaN NaN
3         NaN   NaN  NaN  NaN       NaN NaN
4         NaN   NaN  NaN  NaN       NaN NaN
...       ...   ...  ...  ...       ...  ..
3611207   NaN   NaN  NaN  NaN       NaN NaN
3611208   NaN   NaN  NaN  NaN       NaN NaN
3611209   NaN   NaN  NaN  NaN       NaN NaN
3611210   NaN   NaN  NaN  NaN       NaN NaN
3611211   NaN   NaN  NaN  NaN       NaN NaN

[3611212 rows x 6 columns]

In [9]:
df = df.dropna()

In [10]:
df.isnull().sum()

title        0
year         0
name         0
type         0
character    0
n            0
dtype: int64

In [11]:
### We have arrange the proper name of each column - 
df.columns

Index(['title', 'year', 'name', 'type', 'character', 'n'], dtype='object')

In [16]:
df.rename(columns = {'n': 'rank' , 'title' : 'movie name'}, inplace = True )

In [17]:
df.head(2)

        movie name  year      name   type character  rank
0   Closet Monster  2015  Buffy #1  actor   Buffy 4   0.0
1  Suuri illusioni  1985    Homo $  actor    Guests  22.0

### Now our data modelling done - 
## We are movinng towards the some senariobase question on datasets -

### 1 How many movies are listed in the titles dataframe?

In [18]:
#Ans - 
print('No of Unique Title - ',df['movie name'].nunique())

No of Unique Title -  172292

### 2 What are the earliest two films listed in the titles dataframe?

In [19]:
## Ans - 
print ('Earliest two films - \n ' ,df.head(2))

Earliest two films -
          movie name  year      name   type character  rank
0   Closet Monster  2015  Buffy #1  actor   Buffy 4   0.0
1  Suuri illusioni  1985    Homo $  actor    Guests  22.0

### 3 How many movies have the title "Hamlet"?

In [21]:
# Ans - 
Hamlet = df[df['movie name']== 'Hamlet']
print(Hamlet)

        movie name  year              name     type              character  \
1615        Hamlet  1996        Riz Abbasi    actor  Attendant to Claudius
7438        Hamlet  1921  Fritz Achterberg    actor            Fortinbras,
11242       Hamlet  2009      Hayden Adams    actor                Laertes
11243       Hamlet  2009      Hayden Adams    actor                 Player
13907       Hamlet  1913       Eric Adeney    actor               Reynaldo
...            ...   ...               ...      ...                    ...
3505738     Hamlet  1969    Jennifer Tudor  actress             Court lady
3528322     Hamlet  2000      Diane Venora  actress               Gertrude
3557773     Hamlet  1996     Perdita Weeks  actress          Second Player
3562331     Hamlet  2015   Katie (II) West  actress                Ophelia
3578802     Hamlet  1996      Kate Winslet  actress                Ophelia

         rank
1615      1.0
7438      9.0
11242     7.0
11243     7.0
13907    14.0
...       ...
3505738  23.0
3528322   3.0
3557773  44.0
3562331   7.0
3578802  46.0

[313 rows x 6 columns]

In [22]:
print ('movies name Hamlet count - ',Hamlet.shape)

movies name Hamlet count -  (313, 6)

### 4 How many movies are titled "North by Northwest"?

In [23]:
# Ans - 
Northwest = df[df['movie name']== 'North by Northwest']
print(Northwest)

                 movie name  year               name     type  \
12151    North by Northwest  1959      Stanley Adams    actor
27852    North by Northwest  1959         Andy Albin    actor
54093    North by Northwest  1959       Don Anderson    actor
54307    North by Northwest  1959    Ernest Anderson    actor
92195    North by Northwest  1959  Malcolm Atterbury    actor
...                     ...   ...                ...      ...
3361396  North by Northwest  1959    Eva Marie Saint  actress
3416124  North by Northwest  1959        Doris Singh  actress
3437248  North by Northwest  1959       Helen Spring  actress
3567500  North by Northwest  1959      Susan Whitney  actress
3578877  North by Northwest  1959     Paula Winslowe  actress

                                 character  rank
12151                   Lieutenant Harding   0.0
27852                               Farmer   0.0
54093                               Worker   0.0
54307     Porter on Twentieth Century Ltd.   0.0
92195              Man at Prairie Crossing   0.0
...                                    ...   ...
3361396                        Eve Kendall   2.0
3416124  First United Nations Receptionist   0.0
3437248                             Bidder   0.0
3567500                          Attendant   0.0
3578877                   Woman at Auction   0.0

[112 rows x 6 columns]

In [24]:
print ('movies name North by Northwest count - ',Northwest.shape)

movies name North by Northwest count -  (112, 6)

### 5 When was the first movie titled "Hamlet" made?
## We have already sorted hamlet movie .

In [25]:
#  Ans - 
sorted_Hamlet = Hamlet.sort_values(by='year',ascending=True)
print(sorted_Hamlet.head(1))

        movie name  year               name   type character  rank
1545289     Hamlet  1910  Jean Mounet-Sully  actor    Hamlet   0.0

### 6 List all of the "Treasure Island" movies from earliest to most recent.

In [26]:
# Ans - 
Treasure_Island = df[df['movie name']== 'Treasure Island']
print(Treasure_Island)

              movie name  year                 name     type  \
9432     Treasure Island  1934         Robert Adair    actor
13253    Treasure Island  1950         Chris Adcock    actor
16246    Treasure Island  1985          Yves Afonso    actor
42039    Treasure Island  1972   Cristino Almod?var    actor
55071    Treasure Island  1934  John (XII) Anderson    actor
...                  ...   ...                  ...      ...
3415912  Treasure Island  1999        Rachel Singer  actress
3471316  Treasure Island  1934          Jane Talent  actress
3507587  Treasure Island  1999     Guinevere Turner  actress
3553298  Treasure Island  1918   Eleanor Washington  actress
3556764  Treasure Island  1973            Jane Webb  actress

                          character  rank
9432                   Tom - Seaman   0.0
13253                          Pike  26.0
16246                French captain   8.0
42039                       O'Brien  16.0
55071    Pirate of the Spanish Main  18.0
...                             ...   ...
3415912                        Anna   6.0
3471316                Streetwalker   0.0
3507587                      Evelyn  14.0
3553298             Prologue Player   0.0
3556764                Mrs. Hawkins   6.0

[190 rows x 6 columns]

In [31]:
## Sorting year wise - 
first_Treasure_Island = Treasure_Island.sort_values(by='year',ascending=True)
print(first_Treasure_Island.head(1))

             movie name  year            name   type        character  rank
830114  Treasure Island  1918  Charles Gorman  actor  Prologue Player   0.0

### 7 How many movies were made in the year 1950?

In [36]:
# Ans - 
movie_1950 = df[df['year'] == 1950]
print('number of movies in 1950 - ' ,movie_1950.shape)

number of movies in 1950 -  (22006, 6)

### 8 How many movies were made in the year 1960?

In [37]:
# Ans - 
movie_1960 = df[df['year'] == 1960]
print('number of movies in 1960 - ' ,movie_1960.shape)

number of movies in 1960 -  (18456, 6)

### 9 How many movies were made from 1950 through 1959?

In [39]:
# Ans  -
movies_1950_1959 = df[(df['year'] >= 1950) & (df['year'] <= 1959)]
print('number of movies in 1950-59 - ' ,movies_1950_1959.shape)

number of movies in 1950-59 -  (210986, 6)

### 10 In what years has a movie titled "Batman" been released?

In [45]:
# Ans - 
batman = df[df['movie name'] == 'Batman']
batman_movie_years = batman['year'].unique()
print('a movie titled "Batman" been released - ' , batman_movie_years)

a movie titled "Batman" been released -  [1943 1989]

### 11 How many roles were there in the movie "Inception"?

In [49]:
# Ans - 
inception_roles = df[df['movie name'] == 'Inception']
count_inception_roles = inception_roles.shape
print ('count of roles were there in the movie Inception - ',count_inception_roles)

count of roles were there in the movie Inception -  (77, 6)

## 12 How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [59]:
## Ans - 
inception = df[df['movie name'] == 'Inception']
null = inception[inception['rank'].isnull()]
print(null)
print(' movie "Inception" are NOT ranked by an "n" value - \n',null)

Empty DataFrame
Columns: [movie name, year, name, type, character, rank]
Index: []
 movie "Inception" are NOT ranked by an "n" value -
 Empty DataFrame
Columns: [movie name, year, name, type, character, rank]
Index: []

### 13 But how many roles in the movie "Inception" did receive an "n" value?

In [66]:
# Ans - 
inception = df[df['movie name'] == 'Inception']
rank = inception[inception['rank'].notnull()]
rank_count = rank.shape
print(rank_count)

(77, 6)

### 14 Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [67]:
# Ans - 
north_by_northwest_cast = df[df['movie name'] == 'North by Northwest']

In [73]:
north_by_northwest_cast['rank'] = pd.to_numeric(north_by_northwest_cast['rank'], errors='coerce')
ranked_cast = north_by_northwest_cast[north_by_northwest_cast['rank'].notnull()]
sorted_cast = ranked_cast.sort_values(by='rank')
print(sorted_cast.head())

                 movie name  year             name   type  \
12151    North by Northwest  1959    Stanley Adams  actor
2101335  North by Northwest  1959     Bert Stevens  actor
2098768  North by Northwest  1959  Harvey Stephens  actor
2070928  North by Northwest  1959       Olan Soule  actor
2044560  North by Northwest  1959     Jeremy Slate  actor

                                  character  rank
12151                    Lieutenant Harding   0.0
2101335      Man at United Nations Building   0.0
2098768                         Stockbroker   0.0
2070928                Assistant Auctioneer   0.0
2044560  Policeman at Grand Central Station   0.0

C:\Users\DELL\AppData\Local\Temp\ipykernel_9568\2864602842.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  north_by_northwest_cast['rank'] = pd.to_numeric(north_by_northwest_cast['rank'], errors='coerce')

### 15 Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [75]:
# Ans - 
sleuth_cast = df[(df['movie name'] == 'Sleuth') & (df['year'] == 1972)]
sleuth_cast['rank'] = pd.to_numeric(sleuth_cast['rank'], errors='coerce')
ranked_cast = sleuth_cast[sleuth_cast['rank'].notnull()]
sorted_cast = ranked_cast.sort_values(by='rank')
print(sorted_cast)

        movie name  year                name     type  \
1644328     Sleuth  1972    Laurence Olivier    actor
314691      Sleuth  1972       Michael Caine    actor
360365      Sleuth  1972      Alec Cawthorne    actor
1412647     Sleuth  1972  John (II) Matthews    actor
2619278     Sleuth  1972  Eve (III) Channing  actress
1396572     Sleuth  1972        Teddy Martin    actor

                          character  rank
1644328                 Andrew Wyke   1.0
314691                  Milo Tindle   2.0
360365            Inspector Doppler   3.0
1412647  Detective Sergeant Tarrant   4.0
2619278             Marguerite Wyke   5.0
1396572      Police Constable Higgs   6.0

C:\Users\DELL\AppData\Local\Temp\ipykernel_9568\1772287.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sleuth_cast['rank'] = pd.to_numeric(sleuth_cast['rank'], errors='coerce')

### 16  Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [76]:
# Ans - 
sleuth_cast = df[(df['movie name'] == 'Sleuth') & (df['year'] == 2007)]
sleuth_cast['rank'] = pd.to_numeric(sleuth_cast['rank'], errors='coerce')
ranked_cast = sleuth_cast[sleuth_cast['rank'].notnull()]
sorted_cast = ranked_cast.sort_values(by='rank')
print(sorted_cast)

        movie name  year                 name     type          character  \
250297      Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.
360366      Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler
2619277     Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke
3223502     Sleuth  2007    Carmel O'Sullivan  actress             Maggie
314692      Sleuth  2007        Michael Caine    actor             Andrew
1246855     Sleuth  2007             Jude Law    actor               Milo
1741124     Sleuth  2007        Harold Pinter    actor        Man on T.V.

         rank
250297    0.0
360366    0.0
2619277   0.0
3223502   0.0
314692    1.0
1246855   2.0
1741124   3.0

C:\Users\DELL\AppData\Local\Temp\ipykernel_9568\4204170909.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sleuth_cast['rank'] = pd.to_numeric(sleuth_cast['rank'], errors='coerce')

### 17 How many roles were credited in the silent 1921 version of Hamlet?

In [79]:
# Ans - 
hamlet_1921_roles = df[(df['movie name'] == 'Hamlet') & (df['year'] == 1921)]
num_hamlet_1921_roles = hamlet_1921_roles.shape[0]
print(num_hamlet_1921_roles)

9

### 18 How many roles were credited in Branagh’s 1996 Hamlet?

In [80]:
# Ans - 
branagh_1996_roles = df[(df['movie name'] == 'Branagh') & (df['year'] == 1996)]
num_branagh_1996_roles = branagh_1996_roles.shape[0]
print(num_branagh_1996_roles)

0

### 19 How many "Hamlet" roles have been listed in all film credits through history?

In [82]:
# Ans - 
hamlet_roles = df[df['movie name'] == 'Hamlet']
total_hamlet_roles = hamlet_roles.shape[0]
print(total_hamlet_roles)

313

### 20 How many people have played an "Ophelia"?

In [85]:
## ANs - 
ophelia_roles = df[df['character'] == 'Ophelia']
num_ophelia_actors = ophelia_roles['character'].nunique()
print(num_ophelia_actors)

1

### 21 How many people have played a role called "The Dude"?

In [86]:
## ANs - 
the_dude_roles = df[df['character'] == 'Ophelia']
num_the_dude_actors = the_dude_roles['character'].nunique()
print(num_the_dude_actors)

1

### 22 How many people have played a role called "The Stranger"?

In [89]:
## Ans - 
the_stranger_roles = df[df['character'] == 'The Stranger']
num_the_stranger_actors = the_stranger_roles['character'].nunique()
print(num_the_stranger_actors)

1

### 23 How many roles has Sidney Poitier played throughout his career?

In [90]:
## Ans - 
sidney_poitier_roles = df[df['character'] == 'Sidney Poitier']
num_sidney_poitier_actors = sidney_poitier_roles['character']
print(num_sidney_poitier_actors)

346262    Sidney Poitier
Name: character, dtype: object

### 24 How many roles has Judi Dench played?

In [91]:
# Ans - 
judi_dench_roles = df[df['name'] == 'Judi Dench']
num_judi_dench_roles = judi_dench_roles.shape[0]
print(num_judi_dench_roles)

55

### 25 List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [94]:
# Ans - 
cary_grant_roles_1940s = df[(df['name'] == 'Cary Grant') & (df['year'] >= 1940) & (df['year'] < 1950) & (df['rank'] == 2)]
sorted_roles = cary_grant_roles_1940s.sort_values(by='year')
print(sorted_roles)

              movie name  year        name   type    character  rank
840371  My Favorite Wife  1940  Cary Grant  actor         Nick   2.0
840381    Penny Serenade  1941  Cary Grant  actor  Roger Adams   2.0

### 26  List the leading roles that Cary Grant played in the 1940s in order by year.

In [98]:
## Ans -
cary_grant_leading_roles_1940s = df[ (df['name'] == 'Cary Grant') & (df['year'] >= 1940) &  (df['year'] < 1950) &  (df['rank'] == 1)]
sorted_roles = cary_grant_roles_1940s.sort_values(by='year')
print(sorted_roles)

              movie name  year        name   type    character  rank
840371  My Favorite Wife  1940  Cary Grant  actor         Nick   2.0
840381    Penny Serenade  1941  Cary Grant  actor  Roger Adams   2.0

### 27 How many roles were available for actors in the 1950s?

In [100]:
## Ans - 
roles_1950s = df[(df['year'] >= 1950) & (df['year'] < 1960)]
num_roles_1950s = roles_1950s.shape[0]
print(num_roles_1950s)

210986

### 28 How many roles were available for actresses in the 1950s?

In [107]:
### Ans - 
roles_1950s_actresses = df[(df['year'] >= 1950) & (df['year'] < 1960) & (df['type'] == 'actresses')]
num_roles_1950s_actresses = roles_1950s_actresses.groupby('year').size()
total_count = num_roles_1950s_actresses.sum()
print(total_count)

0

### 29  How many leading roles (n=1) were available from the beginning of film history through 1980?

In [110]:
# Ans - 
leading_roles_until_1980 = df[(df['rank'] == 1) & (df['year'] <= 1980)]
num_leading_roles_until_1980 = leading_roles_until_1980.shape[0]
print(num_leading_roles_until_1980)

63924

###  30 How many non-leading roles were available through from the beginning of film history through 1980?

In [111]:
# ANs -
non_leading_roles_until_1980 = df[(df['rank'] != 1) & (df['year'] <= 1980)]
num_non_leading_roles_until_1980 = non_leading_roles_until_1980.shape[0]
print(num_non_leading_roles_until_1980)

1094780

### 31 How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [113]:
# ANs - 
roles_without_numeric_n_until_1980 = df[(df['year'] <= 1980) & (df['rank'].isna())]
num_roles_without_numeric_n_until_1980 = roles_without_numeric_n_until_1980.shape[0]
print(num_roles_without_numeric_n_until_1980)

0